_posts/2015-11-20-Asynchronously-running-python-blocks-in-org-mode.html
---
title: Asynchronously running python blocks in org-mode
date: 2015/11/20 11:46:45
updated: 2015/11/20 14:13:24
categories: emacs,python,orgmode
tags: 
---


<p>
If you run long Python blocks from org-mode, you might want to keep working while it runs. Currently Emacs gets blocked and you have to wait patiently.  In this post we consider some ways to avoid this that run our code asynchronously, but still put results where they belong in the org-buffer.
</p>

<p>
This is a long post. You may want to see the video: <a href="https://www.youtube.com/watch?v=VDyoN8yipSE">https://www.youtube.com/watch?v=VDyoN8yipSE</a> , or skip to the <a href="#sec-3">end</a> where the best and final version is shown.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> The async module</h2>
<div class="outline-text-2" id="text-1">
<p>
Here we consider an approach that uses <a href="https://github.com/jwiegley/emacs-async">https://github.com/jwiegley/emacs-async</a> module. The idea is to tangle the Python block at point to a temp file, then asynchronously run it. We capture the output and put it back in the buffer. We use a uuid to find the place to put the results in org-mode format. Here is the code that implements this idea.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #0000FF;">require</span> '<span style="color: #D0372D;">async</span>)

(<span style="color: #0000FF;">defun</span> <span style="color: #006699;">org-babel-async-execute</span> ()
  <span style="color: #036A07;">"Run a python block at point asynchrously."</span>
  (<span style="color: #0000FF;">interactive</span>)

  (<span style="color: #0000FF;">let</span> ((current-file (buffer-file-name))
        (uuid (org-id-uuid))
        (temporary-file-directory <span style="color: #008000;">"./"</span>)
        (tempfile (make-temp-file <span style="color: #008000;">"py-"</span>)))

    (org-babel-tangle '(4) tempfile)
    (org-babel-remove-result)
    (<span style="color: #0000FF;">save-excursion</span>
      (re-search-forward <span style="color: #008000;">"#\\+END_SRC"</span>)
      (insert (format
               <span style="color: #008000;">"\n\n#+RESULTS: %s\n: %s"</span>
               (<span style="color: #0000FF;">or</span> (org-element-property <span style="color: #006FE0;">:name</span> (org-element-context))
                   <span style="color: #008000;">""</span>)
               uuid)))

    (<span style="color: #0000FF;">async-start</span>
     <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">what to start</span>
     `(<span style="color: #0000FF;">lambda</span> ()
        <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">now we run the command then cleanup</span>
        (<span style="color: #0000FF;">prog1</span>
            (shell-command-to-string (format <span style="color: #008000;">"python %s"</span> ,tempfile))
          (delete-file ,tempfile)))

     `(<span style="color: #0000FF;">lambda</span> (result)
        <span style="color: #036A07;">"Code that runs when the async function finishes."</span>
        (<span style="color: #0000FF;">save-window-excursion</span>
          (<span style="color: #0000FF;">save-excursion</span>
            (<span style="color: #0000FF;">save-restriction</span>
              (<span style="color: #0000FF;">with-current-buffer</span> (find-file-noselect ,current-file)
                (goto-char (point-min))
                (re-search-forward ,uuid)
                (beginning-of-line)
                (kill-line)
                (insert (mapconcat
                         (<span style="color: #0000FF;">lambda</span> (x)
                           (format <span style="color: #008000;">": %s"</span> x))
                         (butlast (s-split <span style="color: #008000;">"\n"</span> result))
                         <span style="color: #008000;">"\n"</span>))))))))))
</pre>
</div>

<pre class="example">
org-babel-async-execute
</pre>

<p>
Here is a block to test it on. We can run the block, and keep on working while the code runs. The results seem to get inserted correctly at the right point even if I am in another window or frame! We don't get easy access to continuous output of the command. This wouldn't work if we close Emacs, but who does that?
</p>


<div class="org-src-container">

<pre class="src src-python"><span style="color: #0000FF;">print</span> <span style="color: #008000;">'hello world'</span>
<span style="color: #0000FF;">import</span> time
time.sleep(5)

<span style="color: #0000FF;">import</span> os
<span style="color: #0000FF;">print</span> os.getcwd()
<span style="color: #0000FF;">print</span> time.asctime()
</pre>
</div>

<pre class="example">
hello world
/Users/jkitchin/blogofile-jkitchin.github.com/_blog
Fri Nov 20 10:17:53 2015
</pre>

<p>
There are some limitations to this approach. One of them is it assumes the src block is a stand-alone block that will run on its own. That is usually how I run mine, but I could see having other modules that should be tangled out of a file too. I think the script is being run in the current working directory, so it probably will find any local imports it needs.
</p>

<p>
You don't get any intermediate feedback on this process. It seems to be possible to do that with a different approach that puts some output in a new buffer, e.g. with start-process. But, you still need some clever code like the async model to know when to insert the results back into this buffer. We consider Emacs processes and sentinels next.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Emacs process approach with tangling</h2>
<div class="outline-text-2" id="text-2">
<p>
We can start a process in Emacs, and attach a sentinel function to it that runs after the process completes. Here is an example of that. We still tangle the src-block here.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #0000FF;">defun</span> <span style="color: #006699;">org-babel-async-execute</span> ()
  (<span style="color: #0000FF;">interactive</span>)
  (<span style="color: #0000FF;">let*</span> ((current-file (buffer-file-name))
        (uuid (org-id-uuid))
        (temporary-file-directory <span style="color: #008000;">"./"</span>)
        (tempfile (make-temp-file <span style="color: #008000;">"py-"</span>))
        (pbuffer (format <span style="color: #008000;">"*%s*"</span> uuid))
        process)

    (org-babel-tangle '(4) tempfile)
    (org-babel-remove-result)

    (<span style="color: #0000FF;">save-excursion</span>
      (re-search-forward <span style="color: #008000;">"#\\+END_SRC"</span>)
      (insert (format
               <span style="color: #008000;">"\n\n#+RESULTS: %s\n: %s"</span>
               (<span style="color: #0000FF;">or</span> (org-element-property <span style="color: #006FE0;">:name</span> (org-element-context))
                   <span style="color: #008000;">""</span>)
               uuid)))

    (<span style="color: #0000FF;">setq</span> process (start-process
                   uuid
                   pbuffer
                   <span style="color: #008000;">"python"</span>
                   tempfile))

    (set-process-sentinel
     process
     `(<span style="color: #0000FF;">lambda</span> (process event)
        (<span style="color: #0000FF;">when</span> (string= <span style="color: #008000;">"finished\n"</span> event)
          (delete-file ,tempfile)
          (<span style="color: #0000FF;">save-window-excursion</span>
            (<span style="color: #0000FF;">save-excursion</span>
              (<span style="color: #0000FF;">save-restriction</span>
                (<span style="color: #0000FF;">with-current-buffer</span> (find-file-noselect ,current-file)
                  (goto-char (point-min))
                  (re-search-forward ,uuid)
                  (beginning-of-line)
                  (kill-line)
                  (insert (mapconcat
                           (<span style="color: #0000FF;">lambda</span> (x)
                             (format <span style="color: #008000;">": %s"</span> x))
                           (split-string
                            (<span style="color: #0000FF;">with-current-buffer</span> ,pbuffer (buffer-string))
                            <span style="color: #008000;">"\n"</span>)
                           <span style="color: #008000;">"\n"</span>)))))))
        (kill-buffer ,pbuffer)))))
</pre>
</div>

<pre class="example">
org-babel-async-execute
</pre>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #0000FF;">print</span> <span style="color: #008000;">'hello world'</span>
<span style="color: #0000FF;">import</span> time
time.sleep(10)

<span style="color: #0000FF;">import</span> os
<span style="color: #0000FF;">print</span> os.getcwd()
<span style="color: #0000FF;">print</span> time.asctime()
</pre>
</div>

<pre class="example">
hello world
/Users/jkitchin/blogofile-jkitchin.github.com/_blog
Fri Nov 20 10:20:01 2015
</pre>

<p>
That works well from what I can see. There are some limitations. I doubt this will work if you use variables in the src block header. Next we consider an approach that does not do the tangling, and that will show us code output as it goes.
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><a id="ID-D8F2CBB5-31B2-4477-A363-E3C0063214DE" name="ID-D8F2CBB5-31B2-4477-A363-E3C0063214DE"></a><span class="section-number-2">3</span> Emacs process approach with no tangling</h2>
<div class="outline-text-2" id="text-3">
<p>
As an alternative to tangling to a file, here we just copy the code to a file and then run it.
</p>

<p>
UPDATE: I eliminated the send string approach because it caused some problems with blank lines in loops and such. This new approach eliminates that issue.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #0000FF;">defun</span> <span style="color: #006699;">org-babel-async-execute</span> ()
  (<span style="color: #0000FF;">interactive</span>)
  (<span style="color: #0000FF;">let*</span> ((current-file (buffer-file-name))
         (uuid (org-id-uuid))
         (code (org-element-property <span style="color: #006FE0;">:value</span> (org-element-context)))
         (temporary-file-directory <span style="color: #008000;">"."</span>)
         (tempfile (make-temp-file <span style="color: #008000;">"py-"</span>))
         (pbuffer (format <span style="color: #008000;">"*%s*"</span> uuid))
         process)

    (org-babel-remove-result)

    (<span style="color: #0000FF;">save-excursion</span>
      (re-search-forward <span style="color: #008000;">"#\\+END_SRC"</span>)
      (insert (format
               <span style="color: #008000;">"\n\n#+RESULTS: %s\n: %s"</span>
               (<span style="color: #0000FF;">or</span> (org-element-property <span style="color: #006FE0;">:name</span> (org-element-context))
                   <span style="color: #008000;">""</span>)
               uuid)))
    (switch-to-buffer-other-window pbuffer)

    <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">Create temp file</span>
    (<span style="color: #0000FF;">with-temp-file</span> tempfile
      (insert code))

    (<span style="color: #0000FF;">setq</span> process (start-process
                   uuid
                   pbuffer
                   <span style="color: #008000;">"python"</span>
                   tempfile))

    (set-process-sentinel
     process
     `(<span style="color: #0000FF;">lambda</span> (process event)
        (<span style="color: #0000FF;">when</span> (string= <span style="color: #008000;">"finished\n"</span> event)
          (<span style="color: #0000FF;">save-window-excursion</span>
            (<span style="color: #0000FF;">save-excursion</span>
              (<span style="color: #0000FF;">save-restriction</span>
                (<span style="color: #0000FF;">with-current-buffer</span> (find-file-noselect ,current-file)
                  (goto-char (point-min))
                  (re-search-forward ,uuid)
                  (beginning-of-line)
                  (kill-line)
                  (insert
                   <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">This clunky code mostly cleans up the output so it looks</span>
                   <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">more like org-mode output</span>
                   (mapconcat
                    (<span style="color: #0000FF;">lambda</span> (x)
                      (format <span style="color: #008000;">": %s"</span> x))
                    (split-string
                     (replace-regexp-in-string
                      <span style="color: #008000;">"</span><span style="color: #008000; font-weight: bold;">\\</span><span style="color: #008000; font-weight: bold;">(</span><span style="color: #008000;">&gt;&gt;&gt; </span><span style="color: #008000; font-weight: bold;">\\</span><span style="color: #008000; font-weight: bold;">|</span><span style="color: #008000;">\\.\\.\\. </span><span style="color: #008000; font-weight: bold;">\\</span><span style="color: #008000; font-weight: bold;">|</span><span style="color: #008000;">: $</span><span style="color: #008000; font-weight: bold;">\\</span><span style="color: #008000; font-weight: bold;">|</span><span style="color: #008000;">: &gt;&gt;&gt;$</span><span style="color: #008000; font-weight: bold;">\\</span><span style="color: #008000; font-weight: bold;">)</span><span style="color: #008000;">"</span>
                      <span style="color: #008000;">""</span>
                      (mapconcat 'identity
                                 (butlast (split-string
                                            (<span style="color: #0000FF;">with-current-buffer</span>
                                                ,pbuffer
                                              (buffer-string))
                                            <span style="color: #008000;">"\n"</span>))
                                 <span style="color: #008000;">"\n"</span>))
                     <span style="color: #008000;">"\n"</span>)
                    <span style="color: #008000;">"\n"</span>)))))))
        (<span style="color: #0000FF;">when</span> (get-buffer ,pbuffer)
          (kill-buffer ,pbuffer)
          (delete-window))
        (delete-file ,tempfile)
        (delete-process process)))))
</pre>
</div>

<pre class="example">
org-babel-async-execute
</pre>



<p>
Let us try it out again.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #0000FF;">print</span> <span style="color: #008000;">'hello world'</span>
<span style="color: #0000FF;">import</span> time
time.sleep(1)

<span style="color: #0000FF;">for</span> i <span style="color: #0000FF;">in</span> <span style="color: #006FE0;">range</span>(5):
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #0000FF;">print</span> i

<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   time.sleep(0.5)

<span style="color: #0000FF;">import</span> os
<span style="color: #0000FF;">print</span> os.getcwd()
<span style="color: #0000FF;">print</span> time.asctime()
</pre>
</div>

<pre class="example">
hello world
0
1
2
3
4
/Users/jkitchin/blogofile-jkitchin.github.com/_blog
Fri Nov 20 14:11:49 2015
</pre>


<p>
It works fine for this simple example. Again, this example doesn't do anything particularly sophisticated with src-block headers or imports, etc&#x2026; We also get to see the output as the code executes, which is a pleasant change from the usual way of running python blocks.
</p>

<p>
Maybe some org-moder's out there can try this and run it through some more rigorous paces?
</p>
</div>
</div>
<p>Copyright (C) 2015 by John Kitchin. See the <a href="/copying.html">License</a> for information about copying.<p><p><a href="/org/2015/11/20/Asynchronously-running-python-blocks-in-org-mode.org">org-mode source</a><p><p>Org-mode version = 8.2.10</p>